/* 
Операція ... (rest) дозволяє зібрати групу
 незалежних елементів у нову колекцію. Синтаксично - це близнюк операції розподілу, але відрізнити їх просто - розподіл - коли ... знаходиться у правій частині операції присвоювання, а збирання - коли ... знаходиться в її лівій частині.
*/

// const newArr = [1, 2, 3, 5, 6, 7];

// function foo(...newArr) {
//   console.log(newArr);
// }

// foo(10, 20, 30, 40, 50);

/* 
Збирання остаточних параметрів
*/

// function foo(arr1, ...arr2) {
//   console.log(arr1);
//   console.log(arr2);
// }

// foo([1, 2, 3, 4, 5, 6], 1, 3, 5, 6, 7, 7, 2);

// ============================

// const arr = [4, 6, 2, 4, 7, 8, 3, 2, 1, 4, 6];
// const [x, y, ...args] = arr;
// console.log(args);

// ============================

// const user = {
//   a: '10',
//   b: '20',
//   c: '30',
//   d: '40',
//   e: '50',
//   f: '60',
// };
// const { a, b, e, ...newUser } = user;
// console.log(newUser);

// ==================

// const book = {
//   id: 123,
//   title: 'sefsrf',
//   author: '234234',
//   desc: '23423423',
// };

// function updateBook({ id, ...book }) {
//   console.log(id, book);
// }

// updateBook(book);
